#include <bdk.h>
#include <ctype.h>
#include <errno.h>
#include <newport.h>
#include <fw_env.h>
#include <libbdk-arch/bdk-csrs-gpio.h>
#include <libfdt/libfdt.h>

#include "libbdk-arch/bdk-csrs-ap.h"
#include "libbdk-arch/bdk-csrs-fus.h"
#include "libbdk-arch/bdk-csrs-gic.h"
#include "libbdk-arch/bdk-csrs-gpio.h"
#include "libbdk-arch/bdk-csrs-gser.h"
#include "libbdk-arch/bdk-csrs-mio_fus.h"
#include "libbdk-arch/bdk-csrs-pcierc.h"
#include "libbdk-arch/bdk-csrs-vrm.h"

#include "hwconfig.h"

#define min(a, b) ((a) < (b)) ? (a) : (b)
#define BIT(x) (1 << (x))

/* PHY registers */
#define REG_BMCR	0x0
#define REG_PHYCR	0x10
#define REG_PHYSTS	0x11
#define REG_LEDCR1	0x18
#define REG_LEDCR2	0x19
#define REG_LEDCR3	0x1a

/* Extended registers */
#define REG_RGMIICTL	0x0032
#define REG_RGMIIDCTL	0x0086
#define REG_SGMIICTL1	0x00d3
#define REG_STRAP_STS1	0x006e
#define REG_STRAP_STS2	0x006f
#define REG_IO_MUX_CFG	0x0170

/* indirect register access */
#define REG_REGCR	13
#define REG_ADDAR	14

/* Vitesse PHY Registers
 */
#define MSCC_EXT_PAGE_ACCESS			31
#define MSCC_PHY_PAGE_STANDARD			0x0000 /* Standard registers */
#define MSCC_PHY_PAGE_EXTENDED			0x0001 /* Extended registers */
#define MSCC_PHY_PAGE_EXTENDED_2		0x0002 /* Extended reg - page 2 */
#define MSCC_PHY_PAGE_EXTENDED_3		0x0003 /* Extended reg - page 3 */
#define MSCC_PHY_PAGE_EXTENDED_4		0x0004 /* Extended reg - page 4 */
#define MSCC_PHY_PAGE_EXTENDED_GPIO		0x0010 /* Extended reg - GPIO */

/* extended regs */

#define PROC_CMD_NCOMPLETED_TIMEOUT_MS		500

#define MSCC_PHY_MAC_CFG_FASTLINK		19
#define MAC_CFG_MASK				0xc000
#define MAC_CFG_SGMII				0x0000
#define MAC_CFG_QSGMII				0x4000
#define MAC_CFG_RGMII				0x8000

#define MSCC_PHY_TWS_MUX_CTRL1			20
#define TWS_MUX_CTRL1_MASK			0x003f
#define TWS_MUX_CTRL1_50KHZ			0x0000
#define TWS_MUX_CTRL1_100KHZ			0x0010
#define TWS_MUX_CTRL1_400KHZ			0x0020
#define TWS_MUX_CTRL1_2MHZ			0x0030
#define TWS_MUX_CTRL1_PORT_EN(x)		(0x0001 << (x) % 4)

#define MSCC_PHY_TWS_MUX_CTRL2			21
#define TWS_MUX_CTRL2_MASK			0x0fff
#define TWS_MUX_CTRL2_READY			BIT(15)
#define TWS_MUX_CTRL2_PORT_SEL(x)		((x) << 10)
#define TWS_MUX_CTRL2_EXECUTE			BIT(9)
#define TWS_MUX_CTRL2_READ			BIT(8)
#define TWS_MUX_CTRL2_ADDR(x)			((x) & 0xff)
#define TWS_NCOMPLETED_TIMEOUT_MS		10

#define MSCC_PHY_TWS_DATA			22

static int sgmii_phy_id = -1;
static int rgmii_phy_id = -1;
static int tx_delay = -1;
static int rx_delay = -1;

static int if_phy_ti_read(bdk_node_t node, int bus, int addr, int reg)
{
	bdk_mdio_write(node, bus, addr, REG_REGCR, 0x001f);
	bdk_mdio_write(node, bus, addr, REG_ADDAR, reg);
	bdk_mdio_write(node, bus, addr, REG_REGCR, 0x401f);
	return bdk_mdio_read(node, bus, addr, REG_ADDAR);
}

static void if_phy_ti_write(bdk_node_t node, int bus, int addr, int reg,
			    int val)
{
	bdk_mdio_write(node, bus, addr, REG_REGCR, 0x001f);
	bdk_mdio_write(node, bus, addr, REG_ADDAR, reg);
	bdk_mdio_write(node, bus, addr, REG_REGCR, 0x401f);
	bdk_mdio_write(node, bus, addr, REG_ADDAR, val);
}

static int ti_phy_setup(bdk_node_t node, int qlm, int bus, int addr)
{
	int reg, id2;

	/* Check if the PHY is TI PHY we expect */
	id2 = bdk_mdio_read(node, bus, addr, BDK_MDIO_PHY_REG_ID2);

	/* DP83867 */
	if (id2 != 0xa231)
		return -1;

	printf("MDIO%d   : DP83867 (%s)\n", bus,
		(qlm == -1) ? "RGMII" : "SGMII");

	/* LED configuration */
	reg = 0;
	reg |= 0x5 << 4; /* LED1(Amber;Speed)   : 1000BT link */
	reg |= 0xb << 8; /* LED2(Green;Link/Act): blink for TX/RX activity */
	bdk_mdio_write(node, bus, addr, REG_LEDCR1, reg);

	/* RGMII PHY */
	if (qlm == -1) {
		/* Enable CLKOUT */
		reg = if_phy_ti_read(node, bus, addr, REG_IO_MUX_CFG);
		reg &= ~0x1f00;
		reg |= 0x0b00; /* chD tx clock*/
		if_phy_ti_write(node, bus, addr, REG_IO_MUX_CFG, reg);

		/* disable PHY TX delay and enable PHY RX delay
		 * as the default for the CN80XX is to enable TX delay
		 * and disable RX delay
		 */
		reg = if_phy_ti_read(node, bus, addr, REG_RGMIICTL);
		reg &= ~0x3;
		reg |= 0x1; // enable RGMII_RX_CLK_DELAY
		if_phy_ti_write(node, bus, addr, REG_RGMIICTL, reg);
	}

	/* SGMII PHY */
	else if (qlm == 1) {
	}

	return 0;
}

/*
 * Vitesse PHY support
 */
enum if_mode {
	MEDIA_CAT5_COPPER = 0,
	MEDIA_SFP_COPPER = 1,
	MEDIA_1000BASE_X = 2,
	MEDIA_100BASE_FX = 3,
};
const char *if_modes[] = {
	"Cat5 Copper",
	"SFP Copper",
	"1000BASE-X",
	"100BASE-FX",
};
enum mac_mode {
	MAC_QSGMII,
	MAC_SGMII,
};
const char *mac_modes[] = {
	"QSGMII",
	"SGMII",
};

/* See SFF-8472 */
#define u8 unsigned char
struct sfp_msa {
	/* Basic ID fields */
	u8	identifier;		// 0
	u8	ext_identifier;		// 1
	u8	connector;		// 2
	// see Table 3.4
	u8	transceiver_b3;		// 3
	u8	transceiver_b4;		// 4
	u8	transceiver_b5;		// 5

	// GBe compliance codes
	u8	e1000_base_sx:1;	// 6.0
	u8	e1000_base_lx:1;	// 6.1
	u8	e1000_base_cx:1;	// 6.2
	u8	e1000_base_t:1;		// 6.3
	u8	e100_base_lx:1;		// 6.4
	u8	e100_base_fx:1;		// 6.5
	u8	e_base_bx10:1;		// 6.6
	u8	e_base_px:1;		// 6.7

	u8	trans_tech_el1:1;	// 7.0
	u8	trans_tech_lc:1;	// 7.1
	u8	trans_tech_b7_2:1;	// 7.2
	u8	trans_tech_b7_3:1;	// 7.3
	u8	link_len_l:1;		// 7.4
	u8	link_len_i:1;		// 7.5
	u8	link_len_s:1;		// 7.6
	u8	link_len_v:1;		// 7.7

	u8	trans_tech_b8_0:1;	// 8.0
	u8	trans_tech_b8_1:1;	// 8.1
	u8	trans_tech_b8_2:1;	// 8.2
	u8	trans_tech_b8_3:1;	// 8.3
	u8	trans_tech_ll:1;	// 8.4
	u8	trans_tech_sn2:1;	// 8.5
	u8	trans_tech_sn1:1;	// 8.6
	u8	trans_tech_el2:1;	// 8.7

	u8	trans_media_sm:1;	// 9.0
	u8	trans_media_b9_1:1;	// 9.1
	u8	trans_media_m5:1;	// 9.2
	u8	trans_media_m6:1;	// 9.3
	u8	trans_media_tv:1;	// 9.4
	u8	trans_media_mi:1;	// 9.5
	u8	trans_media_tp:1;	// 9.6
	u8	trans_media_tw:1;	// 9.7

	u8	speed_100MBps:1;	// 10.0
	u8	speed_b10_1:1;		// 10.1
	u8	speed_200MBps:1;	// 10.2
	u8	speed_b10_3:1;		// 10.3
	u8	speed_400MBps:1;	// 10.4
	u8	speed_1600MBps:1;	// 10.5
	u8	speed_800MBps:1;	// 10.6
	u8	speed_1200MBps:1;	// 10.7

	u8	encoding;		// 11
	u8	br_nominal;		// 12
	u8	rate_identifier;	// 13
	u8	length_smf_km;		// 14
	u8	length_smf;		// 15
	u8	length_om2;		// 16
	u8	length_om1;		// 17
	u8	length_om4;		// 18
	u8	length_om3;		// 19
	u8	vendor_name[16];	// 20
	u8	transceiver2;
	u8	vendor_oui[3];
	u8	vendor_pn[16];
	u8	vendor_rev[4];
	u8	wavelength[2];
	u8	resv1;
	u8	cc_base;

	/* extended id fields */
	u8	option_b64_0:1;		// 64.0
	u8	option_b64_1:1;		// 64.1
	u8	option_b64_2:1;		// 64.2
	u8	option_b64_3:1;		// 64.3
	u8	option_b64_4:1;		// 64.4
	u8	option_b64_5:1;		// 64.5
	u8	option_b64_6:1;		// 64.6
	u8	option_b64_7:1;		// 64.7

	u8	option_b65_0:1;		// 65.0
	u8	option_los:1;		// 65.1
	u8	option_losn:1;		// 65.2
	u8	option_tx_fault:1;	// 65.3
	u8	option_tx_dis:1;	// 65.4
	u8	option_rate_sel:1;	// 65.5
	u8	option_b65_6:1;		// 65.6
	u8	option_b65_7:1;		// 65.7

	u8	br_max;
	u8	br_min;
	u8	vendor_sn[16];
	u8	date_code[8];
	u8	diags_type;
	u8	enhanced_options;
	u8	sff8472_compliance;
	u8	cc_ext;

	/* Vendor specific ID fields */
	u8	vendor_data[32];
	u8	sff8079[128];
};

enum identifier {
	UNKNOWN,
	GBIC,
	SFF,
	SFP,
	XBI,
	XENPACK,
	XFP,
	XFF,
	XFP_E,
	XPAK,
	X2,
	DWDM_SFP,
	QSFP,
	MAX_ID,
};

